class Constant:

    URLS = {
        'LOGIN_URL': "https://192.168.6.142:7001/LOSWebApp/security/login.htm",
        'HOME_PAGE': "https://192.168.6.142:7001/LOSWebApp/security/mort_main.htm"
    }

    AUTH = {
        'USERNAME': "90057",
        'PASSWORD': "Khaanbank*",
        "wrong_password": "kb2020*"
    }

    data = {
        "citizen_id": "RD00435171"
    }

    loan_purpose_options = ['Сонгох',
                            'Тээврийн хэрэгслийн хэрэглээний лизинг',
                            'Цалингийн зээл',
                            'Өрхийн зээл',
                            'Хадгаламж барьцаалсан зээл',
                            'Тэтгэврийн зээл',
                            'Бусад хэрэглээний лизинг',
                            'Бизнесийн зээл',
                            'Газар тариалангийн зээл',
                            'Кредит карт: Эрх тогтсон',
                            'Signature цалин / Бизнесийн шуурхай бичил',
                            'Кредит карт',
                            'Төсөл / Гадаад худалдааны зээл',
                            'Орон сууцны зээл',
                            'Малчны зээл']

    loan_category_options = ['Шинэ', 'зээл', 'Нэмэлт', 'зээл', 'ЗГБӨО']

    customer_type_options = ['Сонгох',
                             'Монгол иргэн',
                             'Дотоодын БСБ-ын данс',
                             'Засгийн газрын данс',
                             'Гадаадын ЭЗ-н харьяат бус байгууллага',
                             'Өрх гэр, иргэнд үйлчилэгч/УТ нам',
                             'Гадаадын иргэн/зөвшөөрөлтэй',
                             'Гадаадын иргэн/зөвшөөрөлгүй',
                             'Улсын байгууллагын данс',
                             'Хувийн байгууллагын данс']
    
    lending_currency_type = ['Сонгох',
                             'USD:АНУ Доллар',
                             'GBP:Англи Фунт',
                             'AUD:Австрали Доллар',
                             'CAD:Канад Доллар',
                             'MNT:Монгол Төгрөг',
                             'CHF:Швейцари Франк',
                             'CNY:БНХАУ Юань',
                             'DEM',
                             'EUR:Европ Евро',
                             'FRF',
                             'HKD:Хонгконг Доллар',
                             'ITL',
                             'JPY:Япон Иен',
                             'KRW:БНСУ Вон',
                             'RUB:ОХУ Рубль',
                             'SGD:Сингапур Доллар',
                             'NZD:Шинэ Зеланд Доллар']

    repayment_indicator = ['Сонгох', 'Үндсэн зээл ба хүү', 'Зөвхөн хүү']

    loanApplicationFee = ['Сонгох', 'Тийм', 'Үгүй']

    loanProcessingPriority = ['Сонгох', 'Тийм', 'Үгүй']

    promotionalLoan = ['Сонгох', 'Тийм', 'Үгүй']
